CoC_App/CoC_app/app/controllers/characters_controller.rb

  def index
    @characters = Character.all
---
SELECT "characters".* FROM "characters"

  def create
    @character = Character.new(character_params)

    respond_to do |format|
      if @character.save
---
INSERT INTO "characters" ("Name", "Birthplace", "Pronouns", "Ocupation", "Residance", "Age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

    def set_character
      @character = Character.find(params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]