CoC_App/CoC_app/app/views/characters/show.html.erb

SELECT "characteristics".* FROM "characteristics" WHERE "characteristics"."character_id" = ? LIMIT ?  [["character_id", 52], ["LIMIT", 1]]
---

<% characteristic = Characteristic.find_by(character_id: @character.id) %>