CoC_App/CoC_app/app/models/character.rb

    def create_characteristic
      Characteristic.create!(character: self)
---
INSERT INTO "characteristics" ("Strength", "Dexterity", "Constitution", "Appearance", "Power", "Luck", "Size", "Intelligence", "Education", "Character_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"